taboadaa/ShuQi/nRF/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>http://gd32mcu.21ic.com/data/documents/yingyongruanjian/GD32F4</url>
  <name>GD32F4xx_DFP</name>
  <description>GigaDevice GD32F4xx Series Device Support and Examples</description>
  <releases>
  <release version="1.0.1" date="2016-11-23">
    Add GD32F405 and GD32F407 series to Device Family Pack.
  </release>
  <release version="1.0.0" date="2016-08-08">
    First Release version of GD32F4 Device Family Pack.
  </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F4xx</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F4xx Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M4"  Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <feature type="XTAL"               n="4000000"  m="32000000"  name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="8"                                         name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="16000000"                           name="Internal 16M RC oscillator"/>
      <feature type="IntRC"              n="48000000"                           name="Internal 48M RC oscillator"/>      
      <feature type="RTC"                n="32000"                                 name="RTC with 32 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"    n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"    n="4"                                          name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="22"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"          m="85"                name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="3"              m="24"                name="High-Performance ADC"/>
      <feature type="TempSens"      n="1"                                          name="Temperature sensor"/>
      <feature type="Timer"             n="2"              m="32"                name="32-bit General Purpose Timer"/>
      <feature type="Timer"             n="8"              m="16"                name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Advanced Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Basic Timer"/>
      <feature type="Timer"             n="1"              m="24"                name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                          name="Watchdog timer"/>
      <feature type="MPSerial"         n="4"                                          name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/> 
      <feature type="USART"            n="4"              m="12500000"    name="High-Speed USART Interface"/>
      <feature type="UART"              n="4"              m="12500000"    name="High-Speed UART Interface"/>
      <feature type="CAN"               n="2"                                          name="CAN 2.0b Controller"/>
      <feature type="USBOTG"          n="2"                                          name="High-Speed/Full-Speed USB OTG with PHY"/>
      <feature type="GLCD"              n="2"              m="2048.2048"   name="TFT LCD Controller"/>
      <feature type="RNG"                n="1"                                          name="True Random Number Generator"/>
      <feature type="SDIO"               n="1"              m="8"                  name="SDIO Interface"/>
      <feature type="Camera"           n="1"              m="14"                name="Digital Camera Interface"/>
      <feature type="IOs"                 n="140"                                       name="IO pins"/>
      <feature type="I2C"                 n="3"                                           name="Low-Power I2C"/>
      <feature type="SPI"                  n="6"                                          name="SPI Interface"/>
      <feature type="I2S"                  n="5"                                          name="I2S Interface"  />
      <feature type="VCC"                n="2.6"                m="3.6"          name="Voltage"/>
      <feature type="NVIC"               n="91"                                        name="NVIC"/>
      <feature type="Other"              n="3"                                         name="My other Interface"/>
  
<!-- ************************  Subfamily 'GD32F405'  **************************** -->
      <subFamily DsubFamily="GD32F405">
        <processor Dclock="200000000"/>
         <compile header="Device/Include/gd32f4xx.h" define="GD32F405 USE_STDPERIPH_DRIVER "/>
        <debug svd="SVD/GD32F4xx.svd"/>
        <book name="Documents/GD32F4xx_User_Manual.pdf" title="GD32F4xx User Manual"/>
        <description>
        GD32F405 - ARM Cortex-M4 Core
          Frequency up to 200 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 512KB to 3072 KB
          SRAM size is 192 KB with HW parity checking
          30KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F405RE'  ***************************** -->
        <device Dname="GD32F405RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F405RG'  ***************************** -->
        <device Dname="GD32F405RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
