taboadaa/ShuQi/nRF/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.1.pdsc
        <!-- *************************  Device 'GD32F405RK'  ***************************** -->
        <device Dname="GD32F405RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F405VG'  ***************************** -->
        <device Dname="GD32F405VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F405VK'  ***************************** -->
        <device Dname="GD32F405VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F405ZG'  ***************************** -->
        <device Dname="GD32F405ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F405ZK'  ***************************** -->
        <device Dname="GD32F405ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      </subFamily>

<!-- ************************  Subfamily 'GD32F407'  **************************** -->
      <subFamily DsubFamily="GD32F407">
        <processor Dclock="200000000"/>
         <compile header="Device/Include/gd32f4xx.h" define="GD32F407 USE_STDPERIPH_DRIVER"/>
        <debug svd="SVD/GD32F4xx.svd"/>
        <book name="Documents/GD32F4xx_User_Manual.pdf" title="GD32F4xx User Manual"/>
        <description>
        GD32F407 - ARM Cortex-M4 Core
          Frequency up to 200 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 512KB to 3072 KB
          SRAM size is 192 KB with HW parity checking
          30KB ISP loader ROM
        </description>

       <feature type="ETH"                n="1"              m="100000000"  name="Integrated Ethernet MAC with PHY"/>

        <!-- *************************  Device 'GD32F407RE'  ***************************** -->
        <device Dname="GD32F407RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F407RG'  ***************************** -->
        <device Dname="GD32F407RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F407RK'  ***************************** -->
        <device Dname="GD32F407RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      <!-- *************************  Device 'GD32F407VE'  ***************************** -->
        <device Dname="GD32F407VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

