taboadaa/ShuQi/nRF/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.1.pdsc
  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="GPIO" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_gpio.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="I2C" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_i2c.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="IPA" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Image processing accelerator (IPA) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IPA
        </RTE_Components_h>
        <files>
          <!-- IPA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_ipa.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_ipa.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="IREF" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Programmable current reference(IREF) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IREF
        </RTE_Components_h>
        <files>
          <!-- IREF flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_iref.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_iref.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="MISC" Cversion="1.0.1" condition="GD32F4xx CMSIS">
      <description>MISC driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_misc.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="PMU" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_pmu.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="RCU" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_rcu.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="RTC" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_rtc.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="SDIO" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_sdio.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_spi.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="SYSCFG" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>System Configuration(SYSCFG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SYSCFG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_syscfg.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="TIMER" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_timer.c" attr="config" version="1.0.1" />
        </files>
    </component>

