taboadaa/ShuQi/nRF/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.1.pdsc
  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="TLI" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>TFT-LCD interface(TLI) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TLI
        </RTE_Components_h>
        <files>
          <!-- TLI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_tli.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_tli.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="TRNG" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
        </RTE_Components_h>
        <files>
          <!-- TRNG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_trng.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_trng.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="USART" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_usart.c" attr="config" version="1.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F4xx_StdPeripherals" Csub="WWDGT" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f4xx_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f4xx_wwdgt.c" attr="config" version="1.0.1" />
        </files>
    </component>

    <!-- Utilities GD32F4xx -->

    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F4xx" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f4xx_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f4xx_eval.c" attr="config" version="1.0.1"/>
      </files>
    </component>

   <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450I" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f450i_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f450i_eval.c" attr="config" version="1.0.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450Z" Cversion="1.0.1" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f450z_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f450z_eval.c" attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Config GD32F4xx -->
    <component Cclass="Device" Cgroup="GD32F4xx_libopt" Cversion="1.0.1" condition="GD32F4xx CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32f4xx_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32F405 -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.0.1" condition="GD32F405">
      <description>System Startup for GigaDevice GD32F405 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f405.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f4xx.c"      attr="config" version="1.0.1"/>
      </files>
    </component>

   <!-- Startup GD32F407 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.1" condition="GD32F407">
      <description>System Startup for GigaDevice GD32F407 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f407.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f4xx.c"      attr="config" version="1.0.1"/>

      </files>
    </component>

   <!-- Startup GD32F450 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.1" condition="GD32F450">
      <description>System Startup for GigaDevice GD32F450 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f450.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f4xx.c"      attr="config" version="1.0.1"/>
      </files>
    </component>
  </components>

</package>
